<?php
//p1.php
    include  "bn.html";
    echo "<br>";
    echo "<h1>โปรแกรมคำนวณหาค่า BMI v1</h1>";
/*
กฎเกณฑ์การตั้งชื่อของตัวแปร PHP
1 ตัวแปรทั้งหมดในภาษา PHP จะขึ้นต้นด้วยเครื่องหมาย $ แล้วตามด้วยชื่อตัวแปร
2 ชื่อของตัวแปรต้องขึ้นต้นด้วยตัวอักษรหรือเครื่องหมาย _ เท่านั้น
3 ชื่อของตัวแปรสามารถมีตัวอักษร ตัวเลข หรือขีดล่างเท่านั้น
4 ชื่อของตัวแปรต้องไม่มีช่องว่าง
5 ตัวอักษรตัวใหญ่ตัวเล็กถือว่าต่างกัน
6 สอดคล้องกับข้อมูลที่เก็บ
*/   
    $name = "ธนาดุล";
    $sername = "พุฒซ้อน";
    $height = 173; //ส่วนสูง(CM)
    $weight =56;  //น้ำหนัก (Kg)
    //สูตรคำนวณหาค่า bmi =  น้ำหนักตัว[Kg] / (ส่วนสูง[m] ยกกำลังสอง)
    $bmi = $weight / pow(($height/100),2);
    echo "ข้อมูลของคุณ" . $name . " " . $sername . "<br>";
    echo "ค่าดัชนีมวลกาย (BMI) = ";
    echo number_format($bmi,2) . "<br>";
    echo "<img src=pbmi.jpg width = 300px><br>";
?>